<a href="https://colab.research.google.com/github/ASLManasa/MY_Ml/blob/main/Multiariable_Regression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [19]:
import math
import pandas as pd
import numpy as np
from sklearn import linear_model

In [20]:
df = pd.read_csv('/content/prices.csv')
df

   area  bedrooms  age   price  Unnamed: 4
0  2600       3.0   20  550000         NaN
1  3000       4.0   15  565000         NaN
2  3200       NaN   18  610000         NaN
3  3600       3.0   30  595000         NaN
4  4000       5.0    8  760000         NaN
5  4100       6.0    8  810000         NaN

In [21]:
median_bedrroom = math.floor(df.bedrooms.median())
median_bedrroom

4

In [22]:
df.bedrooms = df.bedrooms.fillna(median_bedrroom)
df

   area  bedrooms  age   price  Unnamed: 4
0  2600       3.0   20  550000         NaN
1  3000       4.0   15  565000         NaN
2  3200       4.0   18  610000         NaN
3  3600       3.0   30  595000         NaN
4  4000       5.0    8  760000         NaN
5  4100       6.0    8  810000         NaN

In [ ]:
regressor = linear_model.LinearRegression()
regressor.fit(df[['area','bedrooms','age']],df.price)

In [ ]:
regressor.coef_

In [ ]:
regressor.intercept_

In [26]:
regressor.predict([[3000,3,40]])

array([498408.25158031])